pws-system.org
#+TITLE: PWS – Sistema di pubblicazione EPrivacy
#+AUTHOR: Emmanuele Somma
#+PROPERTY: header-args :tangle no
#+OPTIONS: toc:nil num:nil

* Introduzione

Questo file è il cuore del sistema di pubblicazione PWS (Publishing Workflow System)
per il progetto E-Privacy. Il codice è scritto in Emacs Lisp secondo lo stile 
"literate programming", ed è suddiviso in sezioni modulari che verranno tanglate
in file distinti nella directory dei sorgenti.

Le funzionalità principali comprendono:

- Caricamento delle edizioni e metadati da file `vars.org`
- Analisi e stato dei repository Git (`private`, `public`)
- Visualizzazione testuale interattiva della dashboard
- Comandi per attivare/disattivare/modificare documenti
- Navigazione tra edizioni
- Generazione dei file finali (markdown/org/export)

* edoc-vars.el - Parsing dei file vars.org
#+PROPERTY: header-args:emacs-lisp :tangle edoc-vars.el

Questo modulo si occupa di caricare e analizzare il file `vars.org` contenente i metadati
principali dell’edizione corrente. Restituisce un alist o plist con le informazioni estratte.


#+BEGIN_SRC emacs-lisp :tangle edoc-vars.el
;;; edoc-vars.el --- Parsing del file vars.org -*- lexical-binding: t -*-

(require 'org-element)

(setq edoc--synth-rules-vars
      '((:SLUG . (lambda (vars file)
                   (let ((n (plist-get vars :eprivacy_n))
                         (base (file-name-base file)))
                     (format "e-privacy-%s-%s" (or n "ERROR") base))))))


(defun edoc-parse-vars (file)
  "Parsa il file vars.org e restituisce un plist con tutte le keyword #+KEY: e i documenti aggiuntivi."
  (with-temp-buffer
    (insert-file-contents file)
    (org-mode)
    (let* ((parsed (org-element-parse-buffer))
           (vars (edoc--extract-all-keywords parsed))
           (extra-docs (edoc--extract-documents-table parsed)))
      (plist-put vars :extra-documents extra-docs)
      vars)))

(defun edoc--extract-all-keywords (parsed)
  "Estrae tutte le keyword #+KEY: dal buffer Org come plist, lowercase."
  (let (result)
    (org-element-map parsed 'keyword
      (lambda (el)
        (let* ((key (org-element-property :key el))
               (val (string-trim (org-element-property :value el))))
          (setq result (plist-put result (intern (concat ":" (downcase key))) val)))))
    result))

(defun edoc--extract-documents-table (parsed)
  "Estrae la tabella 'Documenti aggiuntivi' dal file e restituisce una lista di alist."
  (let ((tables (org-element-map parsed 'table
                  (lambda (tbl)
                    (let ((title (org-element-property :raw-value
                                                       (org-element-lineage tbl '(headline)))))
                      (when (and title (string-match "Documenti aggiuntivi" title))
                        tbl))))))
    (when tables
      (let* ((table (car tables))
             (rows (org-table-to-lisp
                    (org-element-interpret-data table))))
        ;; Rimuove intestazione
        (let ((header (car rows))
              (body (cdr rows)))
          (mapcar (lambda (row)
                    (cl-pairlis (mapcar #'intern (mapcar #'downcase header)) row))
                  body))))))

(defun edoc--org-vars-to-md-header (vars)
  "Trasforma un plist di variabili in intestazione Markdown `Chiave: Valore`."
  (let* ((alist (edoc--plist-to-alist vars))
         (lines
          (mapcar (lambda (pair)
                    (format "%s: %s"
                            (capitalize (substring (symbol-name (car pair)) 1))
                            (cdr pair)))
                  (sort alist (lambda (a b)
                                (string< (symbol-name (car a)) (symbol-name (car b))))))))
    (concat (string-join lines "\n") "\n\n")))


(defun edoc--read-options-line ()
  "Restituisce tutte le opzioni `#+OPTIONS:` da `options.org` come stringa unica."
  (let* ((path (expand-file-name "options.org" edoc-current-edition-path))
         (lines (when (file-readable-p path)
                  (with-temp-buffer
                    (insert-file-contents path)
                    (goto-char (point-min))
                    (let (results)
                      (while (re-search-forward "^#\\+OPTIONS:\\s-*\\(.*\\)" nil t)
                        (push (match-string 1) results))
                      (string-join (nreverse results) " "))))))
    (or lines "—")))


(provide 'edoc-vars)
#+END_SRC


* edoc-git.el - Stato dei repository Git
#+PROPERTY: header-args:emacs-lisp :tangle edoc-git.el

Questo modulo gestisce il fetch, lo stato dei branch, l’autore e la data dell’ultimo commit,
e il controllo di divergenza tra locale e remoto per i due repository.


#+BEGIN_SRC emacs-lisp :tangle edoc-git.el
;;; edoc-git.el --- Stato Git per PWS -*- lexical-binding: t -*-

(defun edoc-git-last-commit-summary (repo-path)
  "Restituisce un riassunto dell’ultimo commit nel repository in REPO-PATH."
  (when (file-directory-p repo-path)
    (let ((default-directory repo-path))
      (with-temp-buffer
        (call-process "git" nil t nil "log" "-1" "--pretty=format:%an (%ar)")
        (string-trim (buffer-string))))))

(defun edoc-git-up-to-date-p (repo-path)
  "Restituisce t se il repository locale è aggiornato rispetto al remoto."
  (when (file-directory-p repo-path)
    (let ((default-directory repo-path))
      (call-process "git" nil nil nil "fetch")
      (with-temp-buffer
        (call-process "git" nil t nil "status" "-uno")
        (goto-char (point-min))
        (not (re-search-forward "Your branch is behind" nil t))))))

(defun edoc-git-repo-dirty-p (repo-path)
  "Restituisce t se il repository contiene modifiche locali non committate."
  (when (file-directory-p repo-path)
    (let ((default-directory repo-path))
      ;; git diff --quiet restituisce 1 se ci sono modifiche
      (= (call-process "git" nil nil nil "diff" "--quiet") 1))))


(provide 'edoc-git)
#+END_SRC

